// двумерный массив и программу которая поменяет местами  строки.i
// int[,] ChangeRows(int[,] array, int row1, int row2)
// {
//   if(row1>=array.GetLength(0)  row2>=array.GetLenght(0))
//    return array;
//    else
//   {
//         for(int j=0; j<array.GetLenght1;j++)
//        {
//         int temp = array[row1,j];
//         array[row1,j]=array[row2,j];
//         array[row1,j]=temp;
//        }
//    }
// }
//Задайте двумерный массив. Напишите программу, которая заменяет строки на столбцы. В случае, если это невозможно, программа должна вывести сообщение для пользователя.
//Из двумерного массива целых чисел удалить строку и столбец, на пересечении которых расположен наименьший элемент.
